app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "bode", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "gfxfg"], ["bode", "xgffxddxv"], ["user_id", 1], ["created_at", "2019-09-25 18:40:46.615762"], ["updated_at", "2019-09-25 18:40:46.615762"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save